WcfHarness/WcfHarness/RequestXmls/GetRoleScopes.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetRoleScopes xmlns="http://www.tavisca.com/Vexiere/IRole/2013/01">
      <getRoleScopesRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:RoleId>1</a:RoleId>
      </getRoleScopesRequest>
    </GetRoleScopes>
  </s:Body>
</s:Envelope>